{
  "name": "Tun Keltesch",
  "tagline": "Building AI tools for negotiation, shared expenses, and visual understanding.",
  "about": {
    "paragraphs": [
      { "text": "I'm Tun — AI engineer, builder, and the kind of person who reads *Never Split the Difference* and *Zero to One* back to back and immediately applies it to whatever I'm working on." },
      { "text": "I run TK MEDIA, a software studio based in Luxembourg. We build for clients who need things done right and fast — web, AI, automation — and we ship our own products on the side. Sharp team, no bloat, high standards." },
      { "text": "I care deeply about problems that affect people daily but still have terrible solutions. That's what drives what I build." },
      { "text": "Luxembourgish by origin, which means English, French, German, and Luxembourgish are all just... normal. Building across borders comes with the passport." },
      { "text": "Something bigger is in the works. More soon." }
    ]
  },
  "tkMedia": {
    "title": "TK MEDIA",
    "subtitle": "My Software Studio",
    "description": "TK MEDIA is a small software studio I started to build and ship products fast. We focus on web apps and AI automation, and we build and own our own products — ExpenseMate and NegotiationEdge.",
    "link": "https://www.tkmedia.lu/",
    "linkText": "Visit TK MEDIA"
  },
  "products": [
    {
      "name": "ExpenseMate",
      "tag": "Product · TK MEDIA",
      "tagline": "Smart receipt scanning and bill-splitting app that turns messy group expenses into clean, fair splits.",
      "bullets": [
        "Scan any receipt — AI extracts items, prices, and tax automatically",
        "Split with friends, travel groups, or housemates in seconds",
        "Track who owes what across multiple events and settle up easily"
      ],
      "link": "https://expensemate.app",
      "linkText": "View ExpenseMate",
      "status": "live",
      "image": "/assets/expensemate_demo.mov"
    },
    {
      "name": "NegotiationEdge",
      "tag": "Product · TK MEDIA",
      "tagline": "AI negotiation coach that lets you practice high-stakes conversations in realistic simulations.",
      "bullets": [
        "Practice salary talks, vendor deals, or investor pitches against AI",
        "Get real-time feedback on your strategy, tone, and leverage",
        "Built because I wanted to get better at negotiation — so I built the tool I wanted"
      ],
      "link": "https://negotiationedge.app",
      "linkText": "Join the Waitlist",
      "status": "coming-soon"
    }
  ],
  "experiments": [
    {
      "name": "Text2UML",
      "tagline": "Turn natural language into UML diagrams for faster system thinking.",
      "description": "A VS Code extension that automatically generates graphical UML representations from textual diagram descriptions. Built as my Bachelor's thesis at RWTH Aachen — combines a Java-based Language Server Protocol backend with a React + D3.js visualization frontend.",
      "tech": ["Java", "TypeScript", "React", "D3.js", "MontiCore"],
      "link": "/text2uml",
      "linkType": "internal"
    },
    {
      "name": "Tennis Coach AI",
      "tagline": "RAG-powered tennis coaching from 33 real coaching transcripts.",
      "description": "A retrieval-augmented generation system trained on 601 chunks from real tennis coaching sessions. Uses hybrid search (BM25 + vector similarity) to find relevant coaching advice, supports English and German with auto-detection, and cites its sources.",
      "tech": ["FastAPI", "PostgreSQL", "pgvector", "OpenAI API", "Next.js", "Python"],
      "link": "https://mtc-ai-chat.vercel.app",
      "linkType": "live"
    }
  ],
  "nowAndNext": [
    "Evolving ExpenseMate from social bill-splitting into a broader money management companion.",
    "Preparing NegotiationEdge for broader early-adopter testing.",
    "Co-founding a company in vision AI — applying computer vision and video analysis to racket sports."
  ],
  "socialLinks": [
    { "title": "GitHub", "url": "https://github.com/SM1LE21", "icon": "/icons/github.svg" },
    { "title": "Email", "url": "mailto:tun.keltesch@gmail.com", "icon": "/icons/email.svg" },
    { "title": "LinkedIn", "url": "https://www.linkedin.com/in/tun-keltesch-830294250/", "icon": "/icons/linkedin.svg" }
  ]
}
